In [ ]:
import os
os.getcwd()

In [12]:
import pandas as pd
import numpy as np

In [14]:
data = pd.read_csv('StockData.csv')

In [16]:
data.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [18]:
data.tail()

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [8]:
new_data = pd.read_excel('new.xlsx')

In [20]:
data.isnull().sum()

stock    0
date     0
price    0
dtype: int64

In [24]:
data.dtypes

stock     object
date      object
price    float64
dtype: object

In [26]:
data.duplicated().sum()

0

In [28]:
data.describe()

             price
count  5036.000000
mean     73.057030
std      29.011126
min      28.400000
25%      54.067500
50%      69.085000
75%      79.250000
max     179.260000

In [30]:
data.shape

(5036, 3)

In [32]:
data['price'].min()

28.4

In [36]:
data[data['price']==data['price'].min()]

     stock        date  price
4072   ZTS  11-04-2014   28.4

In [48]:
data[data['price']==data['price'].max()]


#data['price'].max()

#Finds the maximum value in the 'price' column.

#data['price'] == data['price'].max()

#Creates a Boolean mask (True/False) where True indicates rows where 'price' equals the maximum value.

#data[...]

#Filters the data DataFrame, returning only rows where the condition is True.

     stock        date   price
1244  AAPL  18-01-2018  179.26

In [50]:
data['stock'].unique()

array(['AAPL', 'SNI', 'TJX', 'ZTS'], dtype=object)